## stat e raggruppamenti

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'frutto': ['Mela', 'Banana', 'Arancia', 'Pera', 'Uva', 'Fragola', 'Ciliegia', 'Ananas', 'Kiwi', 'Melone'],
    'prezzo': [1.2, 0.8, 1.5, 1.0, 2.5, 3.0, 2.8, 4.5, 2.2, 3.8],  # in euro
    'quantità': [10, 8, 12, 6, 5, 20, 15, 3, 9, 7],  # numero di unità
    'data_acquisto': ['2024-09-01', '2024-09-02', '2024-09-03', '2024-09-04', '2024-09-05',
                      '2024-09-06', '2024-09-07', '2024-09-08', '2024-09-09', '2024-09-10'],
    'peso': [0.15, 0.18, 0.2, 0.25, 0.05, 0.02, 0.01, 1.2, 0.09, 1.5]  # peso per unità in kg
}

# Creiamo il DataFrame
tab = pd.DataFrame(data)

tab

     frutto  prezzo  quantità data_acquisto  peso
0      Mela     1.2        10    2024-09-01  0.15
1    Banana     0.8         8    2024-09-02  0.18
2   Arancia     1.5        12    2024-09-03  0.20
3      Pera     1.0         6    2024-09-04  0.25
4       Uva     2.5         5    2024-09-05  0.05
5   Fragola     3.0        20    2024-09-06  0.02
6  Ciliegia     2.8        15    2024-09-07  0.01
7    Ananas     4.5         3    2024-09-08  1.20
8      Kiwi     2.2         9    2024-09-09  0.09
9    Melone     3.8         7    2024-09-10  1.50

In [7]:
stat = tab.describe()
stat

          prezzo   quantità       peso
count  10.000000  10.000000  10.000000
mean    2.330000   9.500000   0.365000
std     1.232026   5.060742   0.529806
min     0.800000   3.000000   0.010000
25%     1.275000   6.250000   0.060000
50%     2.350000   8.500000   0.165000
75%     2.950000  11.500000   0.237500
max     4.500000  20.000000   1.500000

In [8]:
type(stat)

pandas.core.frame.DataFrame

In [9]:
stat.prezzo

count    10.000000
mean      2.330000
std       1.232026
min       0.800000
25%       1.275000
50%       2.350000
75%       2.950000
max       4.500000
Name: prezzo, dtype: float64

In [11]:
mp = stat.prezzo['max']
print(mp)

4.5

In [12]:
stat.loc['max']

prezzo       4.5
quantità    20.0
peso         1.5
Name: max, dtype: float64

In [13]:
stat.loc['max']['quantità']

np.float64(20.0)

In [14]:
# Lista dei mesi
mesi = ['Gennaio', 'Febbraio', 'Marzo', 'Aprile', 'Maggio', 'Giugno', 
        'Luglio', 'Agosto', 'Settembre', 'Ottobre', 'Novembre', 'Dicembre']

# Generiamo valori casuali per ingressi e uscite (tra 1000 e 5000 euro)
ingressi = np.random.randint(1000, 5001, size=12)
uscite = np.random.randint(1000, 5001, size=12)

# Creiamo il DataFrame
cc = pd.DataFrame({
    'mese': mesi,
    'entrate': ingressi,
    'uscite': uscite
})

cc

         mese  entrate  uscite
0     Gennaio     1425    4712
1    Febbraio     1440    4138
2       Marzo     2934    3096
3      Aprile     3919    4665
4      Maggio     3363    3987
5      Giugno     2835    3644
6      Luglio     4948    3112
7      Agosto     2939    3259
8   Settembre     1018    2691
9     Ottobre     1305    4419
10   Novembre     2894    4179
11   Dicembre     1844    3713

In [15]:
cc.sum()

mese       GennaioFebbraioMarzoAprileMaggioGiugnoLuglioAg...
entrate                                                30864
uscite                                                 45615
dtype: object

In [16]:
type(cc.sum())

pandas.core.series.Series

In [17]:
guadagno = cc.sum()["entrate"] - cc.sum()["uscite"]
print(guadagno)

-14751

In [20]:
(cc.entrate-cc.uscite).cumsum()

0     -3287
1     -5985
2     -6147
3     -6893
4     -7517
5     -8326
6     -6490
7     -6810
8     -8483
9    -11597
10   -12882
11   -14751
dtype: int64

In [21]:
g = (cc.entrate-cc.uscite).cumsum().iloc[-1]
print(g)

-14751

In [22]:
cc.uscite.mean()

np.float64(3801.25)

In [23]:
cc.uscite.min()

np.int32(2691)

In [24]:
cc.uscite.max()

np.int32(4712)

In [25]:
tab

     frutto  prezzo  quantità data_acquisto  peso
0      Mela     1.2        10    2024-09-01  0.15
1    Banana     0.8         8    2024-09-02  0.18
2   Arancia     1.5        12    2024-09-03  0.20
3      Pera     1.0         6    2024-09-04  0.25
4       Uva     2.5         5    2024-09-05  0.05
5   Fragola     3.0        20    2024-09-06  0.02
6  Ciliegia     2.8        15    2024-09-07  0.01
7    Ananas     4.5         3    2024-09-08  1.20
8      Kiwi     2.2         9    2024-09-09  0.09
9    Melone     3.8         7    2024-09-10  1.50

In [26]:
mag = [0,1,0,0,1,1,0,1,0,1]
tab['mag'] = mag
tab

     frutto  prezzo  quantità data_acquisto  peso  mag
0      Mela     1.2        10    2024-09-01  0.15    0
1    Banana     0.8         8    2024-09-02  0.18    1
2   Arancia     1.5        12    2024-09-03  0.20    0
3      Pera     1.0         6    2024-09-04  0.25    0
4       Uva     2.5         5    2024-09-05  0.05    1
5   Fragola     3.0        20    2024-09-06  0.02    1
6  Ciliegia     2.8        15    2024-09-07  0.01    0
7    Ananas     4.5         3    2024-09-08  1.20    1
8      Kiwi     2.2         9    2024-09-09  0.09    0
9    Melone     3.8         7    2024-09-10  1.50    1

In [28]:
tab.groupby('mag').groups

{0: [0, 2, 3, 6, 8], 1: [1, 4, 5, 7, 9]}

In [29]:
tab.groupby('mag').groups[1]

Index([1, 4, 5, 7, 9], dtype='int64')

In [30]:
id = tab.groupby('mag').groups[1][0]
print(id)

1

In [31]:
tab.loc[id]

frutto               Banana
prezzo                  0.8
quantità                  8
data_acquisto    2024-09-02
peso                   0.18
mag                       1
Name: 1, dtype: object

In [33]:
for key,el in tab.groupby('mag'):
    print(key)
    print(el)

0
     frutto  prezzo  quantità data_acquisto  peso  mag
0      Mela     1.2        10    2024-09-01  0.15    0
2   Arancia     1.5        12    2024-09-03  0.20    0
3      Pera     1.0         6    2024-09-04  0.25    0
6  Ciliegia     2.8        15    2024-09-07  0.01    0
8      Kiwi     2.2         9    2024-09-09  0.09    0
1
    frutto  prezzo  quantità data_acquisto  peso  mag
1   Banana     0.8         8    2024-09-02  0.18    1
4      Uva     2.5         5    2024-09-05  0.05    1
5  Fragola     3.0        20    2024-09-06  0.02    1
7   Ananas     4.5         3    2024-09-08  1.20    1
9   Melone     3.8         7    2024-09-10  1.50    1

In [34]:
tab.groupby('mag').get_group(0)

     frutto  prezzo  quantità data_acquisto  peso  mag
0      Mela     1.2        10    2024-09-01  0.15    0
2   Arancia     1.5        12    2024-09-03  0.20    0
3      Pera     1.0         6    2024-09-04  0.25    0
6  Ciliegia     2.8        15    2024-09-07  0.01    0
8      Kiwi     2.2         9    2024-09-09  0.09    0

In [35]:
tab.groupby('mag').size()

mag
0    5
1    5
dtype: int64

In [37]:
tab.groupby('mag')['quantità'].sum()

mag
0    52
1    43
Name: quantità, dtype: int64

In [38]:
tab.groupby('mag')['quantità'].mean()

mag
0    10.4
1     8.6
Name: quantità, dtype: float64

In [41]:
st1 = tab.groupby('mag')['quantità'].describe()
st1

     count  mean       std  min  25%   50%   75%   max
mag
0      5.0  10.4  3.361547  6.0  9.0  10.0  12.0  15.0
1      5.0   8.6  6.655825  3.0  5.0   7.0   8.0  20.0

In [42]:
st1['max']

mag
0    15.0
1    20.0
Name: max, dtype: float64

In [44]:
tab.groupby('mag')['prezzo'].agg([np.min, np.max])

C:\Users\paolo\AppData\Local\Temp\ipykernel_13568\1845081063.py:1: FutureWarning: The provided callable <function min at 0x000001A3E780ACA0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  tab.groupby('mag')['prezzo'].agg([np.min, np.max])
C:\Users\paolo\AppData\Local\Temp\ipykernel_13568\1845081063.py:1: FutureWarning: The provided callable <function max at 0x000001A3E780AB60> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  tab.groupby('mag')['prezzo'].agg([np.min, np.max])

     min  max
mag
0    1.0  2.8
1    0.8  4.5

In [45]:
tab.groupby('mag')['prezzo'].agg(['min', 'max'])

     min  max
mag
0    1.0  2.8
1    0.8  4.5

In [47]:
tab.groupby('mag')['prezzo'].agg(['min', 'max', lambda x: np.max(x) - np.min(x)])

     min  max  <lambda_0>
mag
0    1.0  2.8         1.8
1    0.8  4.5         3.7

In [48]:
res = tab.groupby('mag')['prezzo'].agg(
    min_prz=('min'),
    max_prz=('max'),
    delta=lambda x: np.max(x) - np.min(x)
)
res

     min_prz  max_prz  delta
mag
0        1.0      2.8    1.8
1        0.8      4.5    3.7

## join

In [49]:
# Creiamo i dati
data = {
    'codice_prodotto': range(1001, 1006),  # Codici da 1001 a 1010
    'nome': [
        'Mela',
        'Banana',
        'Arancia',
        'Pera',
        'Uva'
    ]
}

# Creiamo il DataFrame
df_prodotti = pd.DataFrame(data)

# Mostriamo il DataFrame
df_prodotti

   codice_prodotto     nome
0             1001     Mela
1             1002   Banana
2             1003  Arancia
3             1004     Pera
4             1005      Uva

In [50]:
# Creiamo i dati
data = {
    'codice_prodotto': range(1001, 1011),  # Codici da 1001 a 1010
    'quantità': [50, 30, 20, 15, 40, 60, 25, 10, 45, 5]  # Quantità di ciascun prodotto
}

# Creiamo il DataFrame
df_magazzino = pd.DataFrame(data)

# Mostriamo il DataFrame
df_magazzino

   codice_prodotto  quantità
0             1001        50
1             1002        30
2             1003        20
3             1004        15
4             1005        40
5             1006        60
6             1007        25
7             1008        10
8             1009        45
9             1010         5

In [51]:
pd.merge(df_prodotti, df_magazzino, on='codice_prodotto')

   codice_prodotto     nome  quantità
0             1001     Mela        50
1             1002   Banana        30
2             1003  Arancia        20
3             1004     Pera        15
4             1005      Uva        40

In [52]:
pd.merge(df_prodotti, df_magazzino, on='codice_prodotto', how='left')

   codice_prodotto     nome  quantità
0             1001     Mela        50
1             1002   Banana        30
2             1003  Arancia        20
3             1004     Pera        15
4             1005      Uva        40

In [53]:
pd.merge(df_prodotti, df_magazzino, on='codice_prodotto', how='right')

   codice_prodotto     nome  quantità
0             1001     Mela        50
1             1002   Banana        30
2             1003  Arancia        20
3             1004     Pera        15
4             1005      Uva        40
5             1006      NaN        60
6             1007      NaN        25
7             1008      NaN        10
8             1009      NaN        45
9             1010      NaN         5